<a href="https://colab.research.google.com/github/Saidmurodjon/data-science/blob/main/Series_metodlari.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as ps
import numpy as np
from pandas import Series #series ma'lumotlar tuzilmasi

In [4]:
cars_dict = {'Malibu':40000, 'Lacetti':20000, 'Toyota':45000, 'Mazda':52000, 'Honda':38000}

In [8]:
cars_dict

{'Malibu': 40000,
 'Lacetti': 20000,
 'Toyota': 45000,
 'Mazda': 52000,
 'Honda': 38000}

In [12]:
cars1= Series(cars_dict)
type(cars1)

pandas.core.series.Series

In [14]:
cars1

Malibu     40000
Lacetti    20000
Toyota     45000
Mazda      52000
Honda      38000
dtype: int64

In [19]:
"Malibu" in cars1

True

In [21]:
"BMW" in cars1

False

In [25]:
models = ['Honda', 'Mazda', 'Lacetti', 'Jaguar', 'Malibu', 'Toyota', 'BMW']
cars2 =Series(cars_dict, index=models)
cars2

Honda      38000.0
Mazda      52000.0
Lacetti    20000.0
Jaguar         NaN
Malibu     40000.0
Toyota     45000.0
BMW            NaN
dtype: float64

In [27]:
cars2.isnull()

Honda      False
Mazda      False
Lacetti    False
Jaguar      True
Malibu     False
Toyota     False
BMW         True
dtype: bool

In [31]:
cars2.notnull()

Honda       True
Mazda       True
Lacetti     True
Jaguar     False
Malibu      True
Toyota      True
BMW        False
dtype: bool

In [33]:
cars1

Malibu     40000
Lacetti    20000
Toyota     45000
Mazda      52000
Honda      38000
dtype: int64

In [35]:
cars2

Honda      38000.0
Mazda      52000.0
Lacetti    20000.0
Jaguar         NaN
Malibu     40000.0
Toyota     45000.0
BMW            NaN
dtype: float64

In [37]:
cars1+cars2

BMW             NaN
Honda       76000.0
Jaguar          NaN
Lacetti     40000.0
Malibu      80000.0
Mazda      104000.0
Toyota      90000.0
dtype: float64

In [39]:
cars2.name = "Avtosalon"

In [41]:
cars2.index.name =" Modellar"
cars2

 Modellar
Honda      38000.0
Mazda      52000.0
Lacetti    20000.0
Jaguar         NaN
Malibu     40000.0
Toyota     45000.0
BMW            NaN
Name: Avtosalon, dtype: float64